num_lesson = int(input())
if num_lesson == 1:
    print('Время начала урока - 8:30, Время конца - 9:15')
elif num_lesson == 2:
    print('Время начала урока - 9:25, Время конца - 10:10')
elif num_lesson == 3:
    print('Время начала урока - 10:20, Время конца - 11:05')
elif num_lesson == 4:
    print('Время начала урока - 11:15, Время конца - 12:00')
elif num_lesson == 5:
    print('Время начала урока - 12:30, Время конца - 13:15')
elif num_lesson == 6:
    print('Время начала урока - 13:25, Время конца - 14:10')
else:
    print('Номер урока некорректен')